-- -----------------------------------------------------
-- Update DB 4 to 5
-- -----------------------------------------------------



-- -----------------------------------------------------
-- Table `qsystem`.`properties`
-- -----------------------------------------------------

ALTER TABLE `properties` ADD `hide` TINYINT(1) NOT NULL DEFAULT 0 COMMENT 'Показывать пользователю этот параметр или нет';
ALTER TABLE `properties` ADD `pdata` TEXT NULL COMMENT 'Не типизированные текстовые данные';


-- -----------------------------------------------------
-- Table `qsystem`.`services`
-- -----------------------------------------------------

ALTER TABLE `services` ADD `inputed_as_number` INT NOT NULL DEFAULT 0 COMMENT 'Если требуется использовать введенные пользователем данные как его номер в очереди. 0 - генерировать как обычно';

-- -----------------------------------------------------
-- Table  `net`
-- -----------------------------------------------------
UPDATE `net` SET version = '5' where id<>-1;

COMMIT;

